homeworks/hw3.md

# Table of Contents

1.  [Question 1](#org513d030)
2.  [Question 2](#orge2e1bdd)
3.  [Question 3](#org34a4a01)
4.  [Question 4](#orgbc75aa3)
5.  [Question 5](#orgb426808)
6.  [Question 6](#orgb4471ff)
7.  [Question 7](#org216d6cd)
8.  [Question 8](#org4996d89)
9.  [Question 9](#org0fc8c6f)
10. [Question 10](#orga47ea05)

A catch up!


<a id="org513d030"></a>

# Question 1

What are the two ways that commands in a unix-y shell can accept input
(other than reading from a file on disk)?


<a id="orge2e1bdd"></a>

# Question 2

What about output?


<a id="org34a4a01"></a>

# Question 3

Create a Dockerfile which includes the standard R environment we've
been using but also includes the "kernlab" R package.


<a id="orgbc75aa3"></a>

# Question 4

Extend that Dockerfile to include the Nice Editor. (Hint: the
rocker/verse machine is based on Ubuntu and thus you install packages
with the apt package manager).


<a id="orgb426808"></a>

# Question 5

What does the following script print on the standard output?

    A_VARIABLE=hello
    B_VARIABLE=world
    echo $A_VARIABLE B_VARIABLE > some-file
    cat some-file

Why?


<a id="orgb4471ff"></a>

# Question 6

What is an IP address (informally)?
What about a port number (informally)?


<a id="org216d6cd"></a>

# Question 7

Describe left, inner, and right joins. 


<a id="org4996d89"></a>

# Question 8

R features several built in data sets. One is about flowers and can be
accessed via \`iris\`.

What tidyvers/dplyr code shows the average sepal length for each
species? Provide the R code here.


<a id="org0fc8c6f"></a>

# Question 9

Create a scatter plot of sepel length against petal width. Color code
the points by species. Provide the R code which creates the figure.


<a id="orga47ea05"></a>

# Question 10

Which Species has the smallest sepel length? Recreate the plot in 9
without that species in the data set. Provide R code which filters the
data set and produces the figure.

g

